Repository: DZXH-TX/LocaleSmith
Catalog: src/LocaleSmith.App/Strings/*/Resources.resw
Source language: en_us
Languages: fr_fr, ja_jp, ru_ru, zh_cn

# QueueDefaultObjective
source: Translate {0} to {1} using {2}.
fr_fr: Traduire {0} en {1} avec {2}.
ja_jp: {2} を使用して {0} を {1} に翻訳します。
ru_ru: Перевести {0} на {1} с помощью {2}.
zh_cn: 使用 {2} 将 {0} 翻译为 {1}。

# QueueUsageNoModelCalls
source: Tokens: no model call was needed; all translations were reused from verified memory.
fr_fr: Jetons : aucun appel au modèle n’était nécessaire ; toutes les traductions ont été réutilisées depuis la mémoire vérifiée.
ja_jp: Tokens: モデル呼び出しは不要でした。すべての翻訳は検証済みメモリから再利用されました。
ru_ru: Токены: вызов модели не потребовался; все переводы взяты из проверенной памяти переводов.
zh_cn: Tokens：无需调用模型；所有译文均从已验证的翻译记忆中复用。

# QueueUsageNoCompletedCalls
source: Tokens: no provider call completed before the task ended.
fr_fr: Jetons : aucun appel au fournisseur ne s’est terminé avant la fin de la tâche.
ja_jp: Tokens: タスクが終了するまでに完了したプロバイダー呼び出しはありませんでした。
ru_ru: Токены: до завершения задания не завершился ни один вызов поставщика.
zh_cn: Tokens：任务结束前没有任何提供方调用完成。

# QueueUsageUnavailable
source: Tokens: the provider did not return usage for {0} call(s).
fr_fr: Jetons : le fournisseur n’a pas renvoyé d’utilisation pour {0} appel(s).
ja_jp: Tokens: プロバイダーは {0} 回の呼び出しについて使用量を返しませんでした。
ru_ru: Токены: поставщик не вернул данные об использовании для вызовов: {0}.
zh_cn: Tokens：提供方未返回 {0} 次调用的用量。

# QueueUsageComplete
source: Tokens · input {0} · output {1} · total {2} · {3} provider call(s)
fr_fr: Jetons · entrée {0} · sortie {1} · total {2} · {3} appel(s) au fournisseur
ja_jp: Tokens · 入力 {0} · 出力 {1} · 合計 {2} · プロバイダー呼び出し {3} 回
ru_ru: Токены · вход {0} · выход {1} · всего {2} · вызовов поставщика: {3}
zh_cn: Tokens · 输入 {0} · 输出 {1} · 总计 {2} · {3} 次提供方调用

# QueueUsagePartial
source: Partial Token usage · input {0} · output {1} · reported total {2} · {3}/{4} call(s) complete
fr_fr: Utilisation partielle des jetons · entrée {0} · sortie {1} · total déclaré {2} · {3}/{4} appel(s) complets
ja_jp: 一部の Token 使用量 · 入力 {0} · 出力 {1} · 報告済み合計 {2} · 完全な呼び出し {3}/{4} 回
ru_ru: Неполные данные о токенах · вход {0} · выход {1} · заявлено всего {2} · полных вызовов: {3}/{4}
zh_cn: 部分 Token 用量 · 输入 {0} · 输出 {1} · 已报告总计 {2} · {3}/{4} 次调用完整

# QueueCancelling
source: Cancelling… rollback will complete before the job stops.
fr_fr: Annulation… la restauration se terminera avant l’arrêt de la tâche.
ja_jp: キャンセルしています… ジョブが停止する前にロールバックを完了します。
ru_ru: Отмена… перед остановкой задания будет завершён откат.
zh_cn: 正在取消…任务会在回滚完成后停止。

# ModelSourcesLoadFailed
source: Model sources could not be loaded: {0}
fr_fr: Impossible de charger les sources de modèles : {0}
ja_jp: モデルソースを読み込めませんでした: {0}
ru_ru: Не удалось загрузить источники моделей: {0}
zh_cn: 无法加载模型源：{0}

# ModelSourceSaved
source: Model source saved. The API key was moved to Windows Credential Manager.
fr_fr: Source de modèle enregistrée. La clé API a été déplacée vers Windows Credential Manager.
ja_jp: モデルソースを保存しました。API キーは Windows 資格情報マネージャーに移動されました。
ru_ru: Источник модели сохранён. Ключ API перемещён в Диспетчер учётных данных Windows.
zh_cn: 模型源已保存；API Key 已移入 Windows 凭据管理器。

# ModelSourceSaveFailed
source: Model source could not be saved: {0}
fr_fr: Impossible d’enregistrer la source de modèle : {0}
ja_jp: モデルソースを保存できませんでした: {0}
ru_ru: Не удалось сохранить источник модели: {0}
zh_cn: 无法保存模型源：{0}

# ModelConnectionTesting
source: Testing connection…
fr_fr: Test de la connexion…
ja_jp: 接続をテストしています…
ru_ru: Проверка подключения…
zh_cn: 正在测试连接…

# ModelConnectionSucceeded
source: Connection succeeded: {0}
fr_fr: Connexion réussie : {0}
ja_jp: 接続に成功しました: {0}
ru_ru: Подключение установлено: {0}
zh_cn: 连接成功：{0}

# ModelConnectionRejected
source: Connection failed: {0}
fr_fr: Échec de la connexion : {0}
ja_jp: 接続に失敗しました: {0}
ru_ru: Сбой подключения: {0}
zh_cn: 连接失败：{0}

# ModelConnectionFailed
source: Connection failed: {0}
fr_fr: Échec de la connexion : {0}
ja_jp: 接続に失敗しました: {0}
ru_ru: Сбой подключения: {0}
zh_cn: 连接失败：{0}

# OllamaModelsEmpty
source: Ollama is reachable, but no downloaded models were reported. Manual entry remains available.
fr_fr: Ollama est accessible, mais aucun modèle téléchargé n’a été signalé. La saisie manuelle reste disponible.
ja_jp: Ollama には接続できましたが、ダウンロード済みモデルは報告されませんでした。引き続き手動で入力できます。
ru_ru: Сервис Ollama доступен, но не сообщил о загруженных моделях. Ручной ввод по-прежнему доступен.
zh_cn: Ollama 可访问，但未报告已下载模型；仍可手动输入。

# OllamaModelsFound
source: Found {0} downloaded model(s).
fr_fr: Nombre de modèles téléchargés trouvés : {0}.
ja_jp: ダウンロード済みモデルが {0} 件見つかりました。
ru_ru: Загруженных моделей найдено: {0}.
zh_cn: 找到 {0} 个已下载模型。

# OllamaModelsRefreshFailed
source: Local models could not be refreshed: {0}. You can keep the manual model name.
fr_fr: Impossible d’actualiser les modèles locaux : {0}. Vous pouvez conserver le nom de modèle saisi manuellement.
ja_jp: ローカルモデルを更新できませんでした: {0}。手動入力したモデル名はそのまま使用できます。
ru_ru: Не удалось обновить локальные модели: {0}. Можно оставить имя модели, введённое вручную.
zh_cn: 无法刷新本地模型：{0}。可继续使用手动模型名称。

# ModelCatalogLoading
source: Refreshing provider-reported models…
zh_cn: 正在刷新提供方报告的模型…

# ModelCatalogEmpty
source: The provider reported no models. Manual entry remains available.
zh_cn: 提供方未报告任何模型；仍可手动输入。

# ModelCatalogFound
source: Found {0} provider-reported model(s).
zh_cn: 找到 {0} 个提供方报告的模型。

# ModelCatalogUnsupported
source: This endpoint does not expose a compatible model list. You can keep the manual model name.
zh_cn: 该端点未提供兼容的模型列表；可继续使用手动模型名称。

# ModelCatalogRefreshFailed
source: Models could not be refreshed: {0}. You can keep the manual model name.
zh_cn: 无法刷新模型：{0}。可继续使用手动模型名称。

# ModelSourceMaxOutputTokensInvalid
source: Maximum response Tokens must be between {0} and {1}.
zh_cn: 单次响应 Tokens 必须在 {0} 到 {1} 之间。

# ModelSourceBatchCharactersInvalid
source: Source characters per batch must be between {0} and {1}.
zh_cn: 每批原文字符目标必须在 {0} 到 {1} 之间。

# ModelSourceDeleted
source: Model source and its stored credential were deleted.
fr_fr: La source de modèle et ses informations d’identification stockées ont été supprimées.
ja_jp: モデルソースと保存済みの資格情報を削除しました。
ru_ru: Источник модели и сохранённые для него учётные данные удалены.
zh_cn: 模型源及其已存凭据已删除。

# ModelSourceDeleteFailed
source: Model source could not be deleted: {0}
fr_fr: Impossible de supprimer la source de modèle : {0}
ja_jp: モデルソースを削除できませんでした: {0}
ru_ru: Не удалось удалить источник модели: {0}
zh_cn: 无法删除模型源：{0}

# ModelSourceFieldsRequired
source: Display name and model name are required.
fr_fr: Le nom d’affichage et le nom du modèle sont requis.
ja_jp: 表示名とモデル名は必須です。
ru_ru: Необходимо указать отображаемое имя и имя модели.
zh_cn: 显示名称和模型名称均为必填项。

# ModelSourceAddressInvalid
source: Enter an absolute HTTP or HTTPS service address.
fr_fr: Saisissez une adresse de service HTTP ou HTTPS absolue.
ja_jp: 絶対 HTTP または HTTPS のサービスアドレスを入力してください。
ru_ru: Введите абсолютный HTTP- или HTTPS-адрес сервиса.
zh_cn: 请输入绝对 HTTP 或 HTTPS 服务地址。

# ModelSourceHttpsRequired
source: Remote model sources must use HTTPS; HTTP is allowed only for loopback services.
fr_fr: Les sources de modèles distantes doivent utiliser HTTPS ; HTTP n’est autorisé que pour les services en boucle locale.
ja_jp: リモートのモデルソースには HTTPS が必要です。HTTP はループバックサービスでのみ使用できます。
ru_ru: Удалённые источники моделей должны использовать HTTPS; HTTP разрешён только для loopback-сервисов.
zh_cn: 远程模型源必须使用 HTTPS；HTTP 仅允许本机回环服务。

# ModelSourceLoopbackOpenAiV1Required
source: Loopback HTTP OpenAI-compatible sources must use an explicit /v1 base address.
fr_fr: Les sources HTTP OpenAI-compatibles en boucle locale doivent utiliser une adresse de base /v1 explicite.
ja_jp: ループバック HTTP の OpenAI 互換モデルソースには明示的な /v1 ベースアドレスが必要です。
ru_ru: Loopback HTTP OpenAI-совместимые источники моделей должны явно использовать базовый адрес /v1.
zh_cn: 本机回环的 HTTP OpenAI 兼容模型源必须明确使用 /v1 基础地址。

# ModelPresetDeepSeekHint
source: DeepSeek accepts the host base URL; /v1 and full chat/completions inputs are normalized.
fr_fr: DeepSeek accepte l’URL de base de l’hôte ; les entrées /v1 et chat/completions complètes sont normalisées.
ja_jp: DeepSeek ではホストのベース URL を使用できます。/v1 または完全な chat/completions を入力した場合は正規化されます。
ru_ru: DeepSeek принимает базовый URL хоста; входные значения /v1 и полные chat/completions нормализуются.
zh_cn: DeepSeek 可使用主机 Base URL；输入 /v1 或完整 chat/completions 地址时会自动避免重复路径。

# ModelPresetQwenHint
source: The default is China pay-as-you-go. Replace it with the matching workspace, region, or plan endpoint when needed.
fr_fr: Le mode par défaut est la tarification à l’usage en Chine. Remplacez-le par le point de terminaison correspondant à l’espace de travail, à la région ou à l’offre si nécessaire.
ja_jp: 既定値は中国向けの従量課金エンドポイントです。必要に応じて、API キーに対応するワークスペース、リージョン、またはプランのエンドポイントへ変更してください。
ru_ru: По умолчанию используется китайский тариф с оплатой по мере использования. При необходимости замените конечную точку на соответствующую рабочей области, региону или тарифу.
zh_cn: 默认值为中国区按量付费地址；如使用工作空间、其他区域或套餐，请替换为与 API Key 匹配的地址。

# ModelPresetXiaomiMimoHint
source: For Xiaomi MiMo Token Plan, replace the endpoint with https://token-plan-cn.xiaomimimo.com/v1.
fr_fr: Pour Xiaomi MiMo Token Plan, remplacez le point de terminaison par https://token-plan-cn.xiaomimimo.com/v1.
ja_jp: Xiaomi MiMo Token Plan を使用する場合は、エンドポイントを https://token-plan-cn.xiaomimimo.com/v1 に変更してください。
ru_ru: Для Xiaomi MiMo Token Plan замените конечную точку на https://token-plan-cn.xiaomimimo.com/v1.
zh_cn: 如使用 Xiaomi MiMo Token Plan，请将地址改为 https://token-plan-cn.xiaomimimo.com/v1。

# ModelPresetMiniMaxHint
source: MiniMax uses the OpenAI-compatible /v1 API. The model suggestion remains editable.
fr_fr: MiniMax utilise l’API /v1 compatible OpenAI. La suggestion de modèle reste modifiable.
ja_jp: MiniMax は OpenAI 互換の /v1 API を使用します。候補のモデル名は編集できます。
ru_ru: MiniMax использует OpenAI-совместимый API /v1. Предложенное имя модели можно изменить.
zh_cn: MiniMax 使用 OpenAI 兼容的 /v1 API；建议模型仍可手动修改。

# ModelPresetDoubaoHint
source: The default is the Beijing ModelArk API. Keep the endpoint ID or regional route editable for your account.
fr_fr: Le réglage par défaut est l’API ModelArk de Pékin. Laissez l’ID du point de terminaison ou la route régionale modifiable selon votre compte.
ja_jp: 既定値は北京リージョンの ModelArk API です。アカウントに合わせてエンドポイント ID またはリージョンのルートを編集できます。
ru_ru: По умолчанию используется пекинский API ModelArk. Идентификатор конечной точки или региональный маршрут можно изменить для вашей учётной записи.
zh_cn: 默认使用北京地域的火山方舟 API；请按账号保留可编辑的接入点 ID 或地域地址。

# ModelPresetZhipuGlmHint
source: The default is Zhipu's general API. Coding Plan and other products may use a different editable endpoint.
fr_fr: Le réglage par défaut est l’API générale de Zhipu. Coding Plan et d’autres produits peuvent utiliser un autre point de terminaison modifiable.
ja_jp: 既定値は Zhipu の汎用 API です。Coding Plan などの製品では、別の編集可能なエンドポイントが必要になる場合があります。
ru_ru: По умолчанию используется общий API Zhipu. Для Coding Plan и других продуктов может потребоваться другая настраиваемая конечная точка.
zh_cn: 默认使用智谱通用 API；Coding Plan 等产品可能需要填写不同的服务地址。

# ModelPresetKimiHint
source: The default is Kimi's China API. For the international platform, use https://api.moonshot.ai/v1.
fr_fr: Le réglage par défaut est l’API chinoise de Kimi. Pour la plateforme internationale, utilisez https://api.moonshot.ai/v1.
ja_jp: 既定値は中国向けの Kimi API です。国際版プラットフォームでは https://api.moonshot.ai/v1 を使用してください。
ru_ru: По умолчанию используется китайский API Kimi. Для международной платформы укажите https://api.moonshot.ai/v1.
zh_cn: 默认使用 Kimi 中国站 API；国际站可改为 https://api.moonshot.ai/v1。

# ModelPresetOpenAiHint
source: OpenAI uses the /v1 API. The model suggestion remains editable.
fr_fr: OpenAI utilise l’API /v1. La suggestion de modèle reste modifiable.
ja_jp: OpenAI は /v1 API を使用します。候補のモデル名は編集できます。
ru_ru: OpenAI использует API /v1. Предложенное имя модели можно изменить.
zh_cn: OpenAI 使用 /v1 API；建议模型仍可手动修改。

# ModelPresetCustomHint
source: Enter any HTTPS OpenAI-compatible base URL and model name; both remain editable.
fr_fr: Saisissez une URL de base HTTPS compatible OpenAI et un nom de modèle ; les deux restent modifiables.
ja_jp: 任意の HTTPS OpenAI 互換ベース URL とモデル名を入力してください。どちらも後から編集できます。
ru_ru: Введите базовый HTTPS-URL совместимого с OpenAI сервиса и имя модели; оба значения можно изменить.
zh_cn: 可输入任意 HTTPS OpenAI 兼容 Base URL 和模型名称，两者都可编辑。

# CredentialNotStored
source: Not stored
fr_fr: Non stocké
ja_jp: 未保存
ru_ru: Не сохранено
zh_cn: 尚未存储

# CliPolicyAllowedDynamic
source: Allowed by the current dynamic allowlist and sandbox policy.
fr_fr: Autorisé par la liste d’autorisation dynamique et la stratégie du bac à sable actuellement en vigueur.
ja_jp: 現在の動的許可リストとサンドボックスポリシーで許可されています。
ru_ru: Разрешено текущим динамическим списком разрешений и политикой песочницы.
zh_cn: 当前动态白名单与沙箱策略允许此命令。

# CliTimeoutFormat
source: {0:0.###} seconds
fr_fr: {0:0.###} secondes
ja_jp: {0:0.###} 秒
ru_ru: {0:0.###} с
zh_cn: {0:0.###} 秒

# CliPolicyExecutableNotAllowed
source: The executable is not on the dynamic allowlist.
fr_fr: L’exécutable ne figure pas dans la liste d’autorisation dynamique.
ja_jp: この実行可能ファイルは動的許可リストに含まれていません。
ru_ru: Исполняемый файл отсутствует в динамическом списке разрешений.
zh_cn: 该可执行文件不在动态白名单中。

# CliPolicyInterpreterNotAllowed
source: Direct shell or interpreter execution is not allowed.
fr_fr: L’exécution directe d’un shell ou d’un interpréteur n’est pas autorisée.
ja_jp: シェルまたはインタープリターを直接実行することはできません。
ru_ru: Прямой запуск оболочки или интерпретатора запрещён.
zh_cn: 禁止直接执行 Shell 或命令解释器。

# CliPolicyAbsoluteBlacklistMatch
source: The command contains an absolutely prohibited pattern.
fr_fr: La commande contient un motif strictement interdit.
ja_jp: コマンドに絶対禁止パターンが含まれています。
ru_ru: Команда содержит безусловно запрещённый шаблон.
zh_cn: 命令包含绝对禁止的模式。

# CliPolicyWorkingDirectoryOutsideSandbox
source: The working directory is outside the allowed sandbox roots.
fr_fr: Le répertoire de travail se trouve en dehors des racines autorisées du bac à sable.
ja_jp: 作業ディレクトリが許可されたサンドボックスのルート外にあります。
ru_ru: Рабочий каталог находится за пределами разрешённых корней песочницы.
zh_cn: 工作目录不在允许的沙箱根目录内。

# CliPolicyPathArgumentOutsideSandbox
source: A path argument escapes the allowed sandbox roots.
fr_fr: Un argument de chemin sort des racines autorisées du bac à sable.
ja_jp: パス引数が許可されたサンドボックスのルート外を参照しています。
ru_ru: Аргумент пути выходит за пределы разрешённых корней песочницы.
zh_cn: 路径参数超出了允许的沙箱根目录。

# CliPolicyProtectedPathAccess
source: The command attempts to access a protected system path.
fr_fr: La commande tente d’accéder à un chemin système protégé.
ja_jp: コマンドが保護されたシステムパスへアクセスしようとしています。
ru_ru: Команда пытается получить доступ к защищённому системному пути.
zh_cn: 命令尝试访问受保护的系统路径。

# CliPolicyTimeoutTooLong
source: The requested timeout exceeds the security limit.
fr_fr: Le délai demandé dépasse la limite de sécurité.
ja_jp: 要求されたタイムアウトがセキュリティ上の上限を超えています。
ru_ru: Запрошенный тайм-аут превышает ограничение безопасности.
zh_cn: 请求的超时时间超过安全上限。

# CliPolicyShellSyntaxNotAllowed
source: Shell operators or redirection syntax are not allowed.
fr_fr: Les opérateurs de shell et la syntaxe de redirection ne sont pas autorisés.
ja_jp: シェル演算子またはリダイレクト構文は使用できません。
ru_ru: Операторы оболочки и синтаксис перенаправления запрещены.
zh_cn: 禁止使用 Shell 运算符或重定向语法。

# CliPolicyEnvironmentExpansionNotAllowed
source: Environment-variable expansion is not allowed in command arguments.
fr_fr: L’expansion des variables d’environnement n’est pas autorisée dans les arguments de commande.
ja_jp: コマンド引数で環境変数を展開することはできません。
ru_ru: Подстановка переменных среды в аргументах команды запрещена.
zh_cn: 命令参数中禁止展开环境变量。

# CliPolicyWorkingDirectoryMissing
source: The sandbox working directory does not exist.
fr_fr: Le répertoire de travail du bac à sable n’existe pas.
ja_jp: サンドボックスの作業ディレクトリが存在しません。
ru_ru: Рабочий каталог песочницы не существует.
zh_cn: 沙箱工作目录不存在。

# CliPolicySensitiveArgumentNotAllowed
source: Credential-like arguments are not allowed in model-authored commands.
fr_fr: Les arguments évoquant des informations d’identification ne sont pas autorisés dans les commandes rédigées par le modèle.
ja_jp: モデルが作成したコマンドに資格情報と思われる引数を含めることはできません。
ru_ru: Аргументы, похожие на учётные данные, запрещены в командах, созданных моделью.
zh_cn: 模型生成的命令不允许包含类似凭据的参数。

# CliPolicyRejected
source: The command was rejected by the security policy.
fr_fr: La commande a été refusée par la stratégie de sécurité.
ja_jp: セキュリティポリシーによりコマンドが拒否されました。
ru_ru: Команда отклонена политикой безопасности.
zh_cn: 命令已被安全策略拒绝。

# CliResultSummaryFormat
source: {0}; exit code {1}; {2:0} ms
fr_fr: {0} ; code de sortie {1} ; {2:0} ms
ja_jp: {0}; 終了コード {1}; {2:0} ms
ru_ru: {0}; код завершения {1}; {2:0} мс
zh_cn: {0}；退出代码 {1}；耗时 {2:0} 毫秒

# CliExitCodeUnavailable
source: n/a
ja_jp: 該当なし
ru_ru: н/д
zh_cn: 不适用

# CliResultStatusCompleted
source: Completed
fr_fr: Terminée
ja_jp: 完了
ru_ru: Завершено
zh_cn: 已完成

# CliResultStatusTimedOut
source: Timed out
fr_fr: Délai dépassé
ja_jp: タイムアウト
ru_ru: Превышено время ожидания
zh_cn: 已超时

# CliResultStatusRejected
source: Rejected
fr_fr: Refusée
ja_jp: 拒否
ru_ru: Отклонено
zh_cn: 已拒绝

# CliResultStatusFailed
source: Failed
fr_fr: Échec
ja_jp: 失敗
ru_ru: Сбой
zh_cn: 失败

# CliResultStatusUnknown
source: Unknown
fr_fr: Inconnu
ja_jp: 不明
ru_ru: Неизвестно
zh_cn: 未知

# CliRejectedSummary
source: The command was rejected before execution.
fr_fr: La commande a été refusée avant son exécution.
ja_jp: 実行前にコマンドが拒否されました。
ru_ru: Команда отклонена до запуска.
zh_cn: 命令已在执行前被拒绝。

# CliFailedSummary
source: The command failed. Expand the result for technical details.
fr_fr: La commande a échoué. Développez le résultat pour consulter les détails techniques.
ja_jp: コマンドが失敗しました。結果を展開して技術的な詳細を確認してください。
ru_ru: Команда завершилась с ошибкой. Разверните результат для просмотра технических сведений.
zh_cn: 命令执行失败；请展开结果查看技术详情。

# CliOutputPreviewTruncated
source: [Preview truncated; expand to inspect]
fr_fr: [Aperçu tronqué ; développez-le pour l’examiner]
ja_jp: ［プレビューは省略されています。展開して確認してください］
ru_ru: [Предварительный просмотр обрезан; разверните для просмотра]
zh_cn: [预览已截断；展开以查看完整内容]

# CliTechnicalReasonLabel.Text
source: Technical reason
fr_fr: Motif technique
ja_jp: 技術的な理由
ru_ru: Техническая причина
zh_cn: 技术原因

# CliExecuting
source: Executing as a low-integrity restricted process…
fr_fr: Exécution dans un processus restreint à faible niveau d’intégrité…
ja_jp: 低整合性の制限付きプロセスとして実行しています…
ru_ru: Выполнение в ограниченном процессе с низким уровнем целостности…
zh_cn: 正在低完整性受限进程中执行…

# CliCompleted
source: Command finished. The audit record was written.
fr_fr: Commande terminée. Une entrée a été inscrite dans le journal d’audit.
ja_jp: コマンドが完了しました。監査記録を書き込みました。
ru_ru: Команда завершена. Запись аудита сохранена.
zh_cn: 命令已完成，审计记录已写入。

# CliTimedOut
source: Command timed out and its process tree was terminated.
fr_fr: Le délai de la commande a expiré et son arborescence de processus a été arrêtée.
ja_jp: コマンドがタイムアウトしたため、プロセスツリーを終了しました。
ru_ru: Время выполнения команды истекло, дерево её процессов завершено.
zh_cn: 命令超时，进程树已终止。

# CliRejected
source: Command was rejected. No process was started.
fr_fr: La commande a été refusée. Aucun processus n’a été démarré.
ja_jp: コマンドが拒否されました。プロセスは開始されていません。
ru_ru: Команда отклонена. Процесс не запускался.
zh_cn: 命令已被拒绝，未启动任何进程。

# CliFailed
source: Command failed. Review the redacted output and audit record.
fr_fr: La commande a échoué. Consultez la sortie expurgée et le journal d’audit.
ja_jp: コマンドが失敗しました。秘密情報を伏せた出力と監査記録を確認してください。
ru_ru: Сбой команды. Просмотрите вывод со скрытыми конфиденциальными данными и запись аудита.
zh_cn: 命令失败，请查看脱敏输出和审计记录。

# CliCancelled
source: Execution cancelled.
fr_fr: Exécution annulée.
ja_jp: 実行をキャンセルしました。
ru_ru: Выполнение отменено.
zh_cn: 执行已取消。

# CliExecutionFailed
source: Command execution failed before a safe result was available. No additional process was started.
fr_fr: L’exécution de la commande a échoué avant qu’un résultat sécurisé ne soit disponible. Aucun processus supplémentaire n’a été démarré.
ja_jp: 安全な結果を取得する前にコマンドの実行が失敗しました。追加のプロセスは開始されていません。
ru_ru: Сбой выполнения команды до получения безопасного результата. Дополнительные процессы не запускались.
zh_cn: 命令执行未能返回安全结果。没有启动任何额外进程。

# ShellSettingsLoadFailed
source: Encrypted settings could not be loaded: {0}
fr_fr: Impossible de charger les paramètres chiffrés : {0}
ja_jp: 暗号化された設定を読み込めませんでした: {0}
ru_ru: Не удалось загрузить зашифрованные настройки: {0}
zh_cn: 无法加载加密设置：{0}

# SettingsLoadFailed
source: Settings could not be loaded: {0}
fr_fr: Impossible de charger les paramètres : {0}
ja_jp: 設定を読み込めませんでした: {0}
ru_ru: Не удалось загрузить настройки: {0}
zh_cn: 无法加载设置：{0}

# SettingsLoadBeforeSave
source: Load settings before saving changes.
fr_fr: Chargez les paramètres avant d’enregistrer les modifications.
ja_jp: 変更を保存する前に設定を読み込んでください。
ru_ru: Загрузите настройки перед сохранением изменений.
zh_cn: 请先加载设置再保存更改。

# SettingsSandboxRequired
source: A sandbox path is required.
fr_fr: Un chemin de bac à sable est requis.
ja_jp: サンドボックスのパスは必須です。
ru_ru: Необходимо указать путь к песочнице.
zh_cn: 必须提供沙箱路径。

# SettingsWorkspaceAndSandboxRequired
source: Workspace and sandbox paths are required.
fr_fr: Les chemins de l’espace de travail et du bac à sable sont requis.
ja_jp: ワークスペースとサンドボックスのパスは必須です。
ru_ru: Необходимо указать пути к рабочей области и песочнице.
zh_cn: 必须同时提供工作区和沙箱路径。

# SettingsWorkspaceSandboxAndLogRequired
source: Workspace, sandbox, and log directory paths are required.
fr_fr: Les chemins de l’espace de travail, du bac à sable et du répertoire des journaux sont requis.
ja_jp: ワークスペース、サンドボックス、ログディレクトリのパスは必須です。
ru_ru: Необходимо указать пути к рабочей области, песочнице и каталогу журналов.
zh_cn: 必须同时提供工作区、沙箱和日志目录路径。

# SettingsSaved
source: Settings saved securely.
fr_fr: Paramètres enregistrés de manière sécurisée.
ja_jp: 設定を安全に保存しました。
ru_ru: Настройки сохранены в защищённом виде.
zh_cn: 设置已安全保存。

# SettingsSaveFailed
source: Settings could not be saved: {0}
fr_fr: Impossible d’enregistrer les paramètres : {0}
ja_jp: 設定を保存できませんでした: {0}
ru_ru: Не удалось сохранить настройки: {0}
zh_cn: 无法保存设置：{0}

# SettingsRestartFailed
source: The app could not restart to apply the display language: {0}
fr_fr: Impossible de redémarrer l’application pour appliquer la langue de l’interface : {0}
ja_jp: 表示言語を適用するためにアプリを再起動できませんでした: {0}
ru_ru: Не удалось перезапустить приложение для применения языка интерфейса: {0}
zh_cn: 应用无法重启以应用显示语言：{0}

# SettingsRestartBlockedByActiveTranslations
source: Wait for active translation jobs to finish or cancel them before restarting the app.
fr_fr: Attendez la fin des tâches de traduction actives ou annulez-les avant de redémarrer l’application.
ja_jp: アプリを再起動する前に、実行中の翻訳ジョブが完了するまで待つか、ジョブをキャンセルしてください。
ru_ru: Дождитесь завершения активных заданий перевода или отмените их перед перезапуском приложения.
zh_cn: 请等待正在进行的翻译任务完成，或先取消任务，再重启应用。

# SettingsNavigationLabel
source: Settings
fr_fr: Paramètres
ja_jp: 設定
ru_ru: Настройки
zh_cn: 设置

# CliDiagnosticCreateFailed
source: The command review could not be opened: {0}
fr_fr: Impossible d’ouvrir l’examen de la commande : {0}
ja_jp: コマンドの確認画面を開けませんでした: {0}
ru_ru: Не удалось открыть проверку команды: {0}
zh_cn: 无法打开命令审阅：{0}

# AssistantNavigationItem.Content
source: Mod project assistant
fr_fr: Assistant de projet de mod
ja_jp: Mod プロジェクトアシスタント
ru_ru: Помощник проекта мода
zh_cn: 模组项目助手

# AssistantTitle.Text
source: Mod project assistant
fr_fr: Assistant de projet de mod
ja_jp: Mod プロジェクトアシスタント
ru_ru: Помощник проекта мода
zh_cn: 模组项目助手
